var local_database = [{
  date: "June 1 2018",
  title: "五月书评",
  imgSrc: "/images/post/crab.jpg",
  avatar: "/images/avatar/1.png",
  content: "【分享境】毕业快乐，祝大家以后的日子都过得开心一点。",
  reading: "7",
  collection: "3",
  headImgSrc: "/images/post/crab.jpg",
  author: "孟仁梓",
  dateTime: "2周前",
  detail: "1. 遥远的桥 【美】Cornelius Ryan\r\n\n《遥远的桥》记录的是市场花园行动（Operation Market Garden）从计划到结束的全过程，该行动二战中最有想象力的一次作战行动，也是盟军损失最惨重的一次行动。如果对军事特别感兴趣的读者一定别错过本书。近水楼台先得月，瑞恩作为二战最杰出的战地记者之一，为本书提供了大量的独家史料。\r\n\n但我并不认为《遥远的桥》是一本好书，我整体读下来的感受不是很好，书中充斥的细节满足了故事的真实性，每个细节单独拿出来都是一篇不错的战地通讯，但是大量琐碎细节严重破坏了叙事的流畅性，如果对军事题材不喜欢的读者会为之困惑，没有继续读下去的动力。\r\n\n综上所述，对军事题材感兴趣的读者可以尝试阅读《遥远的桥》。\r\n\n2. 房思琪的初恋乐园 林奕含\r\n\n《房思琪的初恋乐园》小清新的书名，小清新的书皮，但不是一本小清新的小说，作者结合亲身经历，创作了少女房思琪与其语文教师“师生恋”的故事，师生恋不是一个让人恶心的词，但《房》这本书中李国华和房思琪这段“恋情”描述了一段真实让人作呕的师生恋。房思琪认识李国华的时候还是一名14岁的少女，天真懵懂，对国学充满了热情，对师长充满了敬意；李国华则是一名五十多岁的中年语文教师，对国学有一定研究也对诱骗女学生有丰富的经验。后来，李国华用老师的爱名义去完成了对房思琪性的掠夺，而房思琪也相信能被《长恨歌》的男人不会是一个坏人，这样的关系一直持续了好几年，直到某个时间节点一过便将所有过去升华掉。\r\n\n从另外一方面来讲，性侵未成年少男少女事件是一个特别严重的社会问题，阴霾会在其一生中挥之不去，本书的作者林奕含在本书出版后不久自杀了，26岁早逝，但对于犯罪者而言，却往往能逍遥法外。\r\n\n但《房》的精彩远不止于这两点，《房》的内容如果仅仅是诱奸，《房》的格调充其量不过是一本上不了台面的低俗小说而已，而《房》如果仅仅是事件背后的社会性讨论则缺乏了其文学价值，本书作者在一次访谈中的解读让我从另一个视角看到了本书不俗的文学价值。\r\n\n《房》这本书可读性高的意义一个重要原因是施暴者李国华的形象是丰满的，李国华是个套中人，他的原型是对林奕含施暴的老师，而老师的原型是胡兰成，而无论是李国华还是胡兰成都是即美与恶于一身的男人，恶自然是因为性侵未成年少女。\r\n\n而美则是因为他自身文学造诣的美，学文学的人相信任何情爱诗词都是言有所衷的，李国华是有志的，他是有情的，他应该是思无邪的，一个真正相信中文的人怎么可以背叛这个浩浩汤汤超过五千年的传统，而恰恰他们又背叛本来属于他们的信仰。\r\n\n单独挑出书中的有些话，其实是很美的，是高度艺术化的，如果这是两个正常恋人之间的话，你会觉得，哇，这情话太美了。比如，你想象恋人对你说：妳现在是曹衣带水，我就是吴带当风。或者是：我在爱情，是怀才不遇。\r\n\n像胡兰成、李国华这种人确实可恨，但又有才，思想体系非常的畸形，他们强暴了，性侵了别人，却又给人“一团和气，亦是好的”，有一种美与恶的强烈反差与冲击，你可以说他们的行为下流，但你能说他们的思想体系不美吗？\r\n\n这种人对自己非常自恋，所以对自己无限宽容，本来诱奸的谎言可以说是有无所多的裂缝，而这裂缝靠什么去弥补，靠语言，用修辞，各种各样的引经据典去弥补，以至于让房思琪陷入这样的漩涡中无法自拔。\r\n\n思琪自然是爱李国华的，这毋庸置疑，李国华得到了性又付出了爱吗，答案或许也是付出了的，他爱的应该不是房思琪这种小女生，他是自恋的，他爱的是自己的演讲，他爱的是这个意境，爱的是这个画面。\r\n\n一个真正的文人应该千锤百炼的真心，到最后的回归无非是食色性也而已。\r\n\n3. JavaScript Dom编程艺术 【英】Jeremy Keith\r\n\n近几年，互联网前端发展得挺快的，前端不仅仅局限于切切图，页面排版了，另外高级前端工程师稀缺，全栈也越来越吃香，所以想想学点前端。\r\n\nJS之于前端就向鱼之于水一样，所以JS的意义毋庸置疑，而本书是别人推荐的，网上口碑也还不错，我学的时候感觉如丝般顺滑，所以蛮推荐想学前端的可以在了解html + css后看一下本书，比较适合初学者。",
  postId: 0,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
    title: "夜夜夜夜-齐秦",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
  }
},
{
  title: "小寒记",
  content: "【自言语】今天是小寒，江南多地已经积雪了，故乡的冬天却很少落雪，我对雪的记忆几乎全部来自于杭州。",
  imgSrc: "/images/post/bl.jpg",
  reading: 18,
  detail: "一 今天是小寒，江南多地已经积雪了，故乡的冬天却很少落雪，我对雪的记忆几乎全部来自于杭州。\r\n\n我来杭州读书快四年了，在我回家前杭城总会落雪，雪落在寰宇上，红墙白雪可以百看不厌，无他，就是美得很简单。\r\n\n不知道今年还赶不赶得上看雪吧，看雪要从落雪开始，但如何碰到落雪，则是一种玄学，心怀虔诚总不会错。\r\n\n后记：好彩，杭城飘雪了，2018年第一场雪。",
  collection: 5,
  dateTime: "6个月前",
  headImgSrc: "/images/post/bl.jpg",
  author: "孟仁梓",
  date: "Jan 8 2018",
  avatar: "/images/avatar/1.png",
  postId: 1,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
    title: "鬼迷心窍-李宗盛",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
  }
},
{
  //按住alt + shift + F 可以格式化代码样式
  title: "当我们在谈论经济学时，我们在谈论什么?",
  content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
  detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
  imgSrc: "/images/post/sls.jpg",
  headImgSrc: "/images/post/sls.jpg",
  reading: 62,
  collection: 92,
  author: "知乎",
  date: "Nov 12 2016",
  dateTime: "三天前",
  avatar: "/images/avatar/3.png",
  postId: 2,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
    title: "女儿情-万晓利",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
  }
},
{
  title: "微信·小程序开发工具安装指南",
  content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
  imgSrc: "/images/post/xiaolong.jpg",
  reading: 102,
  detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",
  collection: 92,
  dateTime: "24小时前",
  headImgSrc: "/images/post/xiaolong.jpg",
  author: "猫是猫的猫",
  date: "Nov 20 2016",
  avatar: "/images/avatar/5.png",
  postId: 3,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
    title: "恋恋风尘-老狼",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
  }
},
{
  title: "从视觉到触觉 这款VR手套能给你真实触感",
  content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
  imgSrc: "/images/post/vr.png",
  reading: 102,
  detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
  collection: 26,
  dateTime: "24小时前",
  headImgSrc: "/images/post/vr.png",
  author: "深白色",
  date: "Nov 20 2016",
  avatar: "../../../images/avatar/3.png",
  postId: 4,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
    title: "沉默是金-张国荣",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
  }
},
{
  title: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
  content: "爱奇艺和创维分别作为国内领先的在线视频品牌",
  imgSrc: "/images/post/totoro.png",
  reading: 96,
  detail: "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
  collection: 26,
  dateTime: "21小时前",
  headImgSrc: "/images/iqiyi.png",
  author: "深白色",
  date: "Nov 20 2016",
  avatar: "../../../images/avatar/5.png",
  postId: 5,
  music: {
    url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
    title: "朋友-谭咏麟",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
  }
},
]

module.exports = {
  postList: local_database
}